"""
2. Напишите программу, которая найдёт произведение пар чисел списка.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.

Пример:

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
"""

import random

lst = [random.randint(-10, 10) for _ in range(7)]
res = []
for i in range(len(lst) // 2 + 1):
    res.append(lst[i] * lst[-i - 1])
print(f'{lst} => {res}')